## "Кратные пяти из диапазона"

### Задание

Даны два целые числа a и b.

Выведите на экран все целые **кратные 5** от a до b включительно.

### Формат входных данных

Даны два целые числа. **Не гарантируется**, что a < b. \
Если a > b, то выводим все числа из диапазона [b, a].

### Формат выходных данных

Выведите все числа, требуемые по условию задачи.

### Решение задачи

```python
a = int(input("a: "))
b = int(input("b: "))

a = int(input("Введите a: "))
b = int(input("Введите b: "))

i = 0
j = 0

while i <= (b - a):
    if (a + i) % 5 == 0:
        print (a+i, end=" ")
    i += 1
while j <= (a - b):
    if (b + j) % 5 == 0:
        print (b+j, end=" ")
    j += 1
```
