## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

```python
n = int(input("Введите сторону квадрата: "))

i = 0

if n % 2 == 0:
    while i < n // 2:
        print (" "*i,"#"," "*(n-i*2-2),"#", sep='')
        i += 1
    while i > 0:
        print (" "*(i-1),"#"," "*(n-(i-1)*2-2),"#", sep='')
        i -= 1
else:
    while i < n // 2:
        print (" "*i,"#"," "*(n-i*2-2),"#", sep='')
        i += 1
    print(" "*i, "#",sep='')
    while i-1 >= 0:
        print (" "*(i-1),"#"," "*(n-(i-1)*2-2),"#", sep='')
        i -= 1
```
