## "Дружественные числа"

### Задание

Два натуральных числа называются дружественными, если каждое из них равно сумме всех натуральных делителей другого
(само число при этом не рассматривается в качестве собственного делителя). \
Необходимо найти все пары натуральных дружественных чисел (не равных друг другу), до введенного числа.

### Формат входных данных

Дано одно целое положительное число

### Формат выходных данных

Вывести все пары дружественных чисел, удовлетворяющие условию задачи.

### Решение задачи

```python
n = int(input("Введите число n: "))

frendly_num =[]
summa = 0
i = 0
j = 1
num1 = 1
num2 = 1

while i < n:
    while j < i:
        if i % j == 0:
            summa += j
        j +=1
    frendly_num.append(summa)
    j = 1
    summa = 0
    i += 1

while num1 < len(frendly_num):
    while num2 < len(frendly_num):
        if num2 == frendly_num[num1] and num1 == frendly_num[num2] and num2 != frendly_num[num2]:
            print(num1)
        num2 += 1
    num2 = 1
    num1 += 1
```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|  300  | 220 284 |
