## "Все совершенные число в диапазоне"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Найдите все совершенные числа и их количество в заданном диапазоне [a, b].

### Формат входных данных

Даны два целых положительных числа, границы диапазона. Гарантируется, что a < b.

### Формат выходных данных

Вывести все совершенные числа, а затем их количество.

### Решение задачи

```python
a = int(input("Введите a: "))
b = int(input("Введите b: "))

i = 1
perf_num = 0
count_perf = 0

while a < b: 
    while i < a:
        if a % i == 0:
            perf_num += i
        i += 1
    if a == perf_num:
        count_perf += 1
        print(a, end=" ")
    i = 1
    perf_num = 0
    a += 1
print()
print("Совершенных чисел:", count_perf, "шт.")
```

---

### Подсказки
<details>
<summary>Подсказка-1</summary>
Для решения задачи вам понадобятся вложенные циклы.

```python
while ...:  # внешний цикл
    while ...:  # внутренний цикл
        ...
```
Внешний цикл будет перебирать числа из диапазона, а внутренний проверять, является ли число совершенным.
</details>

<details>
<summary>Подсказка-2</summary>
Для проверки числа на совершенность, воспользуйтесь решение предыдущей задачи "Совершенное число".
</details>
